In [1]:
from rightmove_webscraper import RightmoveData

url = "https://www.rightmove.co.uk/property-for-sale/find.html?searchLocation=KT3&useLocationIdentifier=true&locationIdentifier=OUTCODE%5E1301&buy=For+sale&radius=3.0&minPrice=425000&maxPrice=500000&minBedrooms=3&propertyTypes=detached%2Csemi-detached%2Cterraced&_includeSSTC=on"
rm = RightmoveData(url)

/workspaces/rightmove_webscraper.py/rightmove_webscraper/scraper.py:245: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  results["price"].replace(regex=True, inplace=True, to_replace=r"\D", value=r"")

In [2]:
df = rm.get_results.drop_duplicates()

In [3]:
df[df['postcode']=='KT3']['url'].values

array(['http://www.rightmove.co.uk/properties/158440727#/?channel=RES_BUY'],
      dtype=object)

In [4]:
rm.summary()

   number_bedrooms  count           mean
0                3     70  474570.714286
1                4      3  491666.666667

In [5]:
df = rm.summary(by="postcode")
df['mean'] = round(df['mean']/1000, 0)

df.sort_values(by='mean', ascending=False)

   postcode  count   mean
9       KT6      1  500.0
11     SW19      1  500.0
4       SM1      4  490.0
3       SM4      6  486.0
6       KT4      3  483.0
0       KT9     11  482.0
1       CR4      8  479.0
2       SM3      6  475.0
5      KT19      3  468.0
7       SM5      2  462.0
10     SW15      1  435.0
8       KT3      1  430.0